/**
 * @file    task2.cpp
 * @brief   Тестируем исключения
 *
 * @note    1. Написать класс «робот», моделирующий перемещения
 *             робота по сетке 10x10, у которого есть метод,
 *             означающий задание переместиться на соседнюю позицию.
 *          2. Эти методы должны запускать исключение OffTheField,
 *             если робот должен уйти с сетки, и IllegalCommand,
 *             если подана неверная команда (направление не находится
 *             в нужном диапазоне).
 *          3. Объект исключения должен содержать всю необходимую
 *             информацию — текущую позицию и направление движения.
 *          4. Написать функцию main, пользующуюся этим классом и
 *             перехватывающую все исключения от его методов, а
 *             также выводящую подробную информацию о всех возникающих
 *             ошибках.

 *
 * @copyright Nikita Bulaev 2019
 *
 */

#include <iostream>

int main (int argc, char ** args) {

    return 0;
}
