/**
 * @file    task1.cpp
 * @brief   Тестируем вирутальные функции
 *
 * @note    1. Создать абстрактный класс Figure (фигура).
 *             Его наследниками являются классы Parallelogram (параллелограмм)
 *             и Circle (круг).
 *          2. Класс Parallelogram — базовый для классов Rectangle (прямоугольник),
 *             Square (квадрат), Rhombus (ромб). Для всех классов создать конструкторы.
 *          3. Для класса Figure добавить чисто виртуальную функцию area() (площадь).
 *          4. Во всех остальных классах переопределить эту функцию, исходя из
 *             геометрических формул нахождения площади.
 *
 * @copyright Nikita Bulaev 2019
 *
 */

#include <iostream>

int main (int argc, char ** args) {

    return 0;
}
