/**
 * @file    task2.cpp
 * @brief   Тестируем "Алмаз смерти"
 *
 * @note    1. Создать класс Car (автомобиль) с полями company (компания)
 *             и model (модель).
 *          2. Классы-наследники: PassengerCar (легковой автомобиль) и Bus (автобус).
 *          3. От этих классов наследует класс Minivan (минивэн).
 *          4. Создать конструкторы для каждого из классов, чтобы они выводили данные
 *             о классах.
 *          5. Создать объекты для каждого из классов и посмотреть, в какой п
 *             оследовательности выполняются конструкторы.
 *          6. Обратить внимание на проблему «алмаз смерти».
 *
 * @copyright Nikita Bulaev 2019
 *
 */

#include <iostream>

int main (int argc, char ** args) {

    return 0;
}
