/**
 * @file    task3.cpp
 * @brief   Тестируем вирутальные функции и перегрузку операций
 *
 * @note    1. Создать абстрактный класс Fraction (дробь).
 *          2. От него наследуют два класса: SimpleFraction (обыкновенная дробь)
 *             и MixedFraction (смешанная дробь).
 *          3. Обыкновенная дробь имеет только числитель и знаменатель (например, 3/7 или 9/2),
 *             а смешанная — еще и целую часть (например, 312 ). Предусмотреть, чтобы
 *             знаменатель не был равен 0.
 *          4. Перегрузить математические бинарные операторы (+, -, *, /) для выполнения
 *             действий с дробями, а также унарный оператор (-).
 *          5. Перегрузить логические операторы сравнения двух дробей (==, !=, <, >, <=, >=).
 *             Поскольку операторы < и >=, > и <= — это логические противоположности,
 *             попробуйте перегрузить один через другой.
 *
 * @copyright Nikita Bulaev 2019
 *
 */

#include <iostream>

int main (int argc, char ** args) {

    return 0;
}
